var questions = [
    {
        "Title": "อะไรเอ่ย เมื่อเด็กนุ่งผ้าขาว เมื่อสาวนุ่งผ้าเขียว แก่ทีเดียวนุ่งผ้าแดง",
        "correct": "พริก"
    },
    {
        "Title": "อะไรเอ่ย สูงเทียบฟ้า ต่ำกว่าหญ้านิดเดียว",
        "correct": "ภูเขา"
    },
    {
        "Title": "อะไรเอ่ย ตัวเป็นไม้ ไส้เป็นตะกั่ว หัวเป็นยาง",
        "correct": "ดินสอ"
    },
    {
        "Title": "อะไรเอ่ย มาจากเมืองเจ๊ก ตัวเล็กเสียงดัง",
        "correct": "ประทัด"
    },
    {
        "Title": "อะไรเอ่ย หลังคาติดกับตัว โผล่หัวออกนอกชายคา",
        "correct": "เต่า"
    },
    {
        "Title": "อะไรเอ่ย ตัดโคนก็ไม่ตาย ตัดปลายก็ไม่เน่า",
        "correct": "ผม"
    },
    {
        "Title": "อะไรเอ่ย ซื้อมาเป็นสีดำ นำมาใช้กลายเป็นสีแดง พอสิ้นแรง กลายเป็นสีเทา ต้องเอาไปทิ้ง",
        "correct": "ถ่าน"
    },
    {
        "Title": "อะไรเอ่ย ยิ่งตัดยิ่งยาว",
        "correct": "ถนน"
    },
    {
        "Title": "อะไรเอ่ย แหวนกับแหวน ชนกันที่หันอากาศ เกิดเป็นสัตว์ประหลาดชอบกินหญ้า",
        "correct": "วัว"
    },
];