var questions = [
    {
        "Title": "อะไรเอ่ย เมื่อเด็กนุ่งผ้าขาว เมื่อสาวนุ่งผ้าเขียว แก่ทีเดียวนุ่งผ้าแดง",
        "correct": "พริก"
    },
    {
        "Title": "อะไรเอ่ย สูงเทียบฟ้า ต่ำกว่าหญ้านิดเดียว",
        "correct": "ภูเขา"
    },
    {
        "Title": "อะไรเอ่ย ตัวเป็นไม้ ไส้เป็นตะกั่ว หัวเป็นยาง",
        "correct": "ดินสอ"
    },
    {
        "Title": "อะไรเอ่ย มาจากเมืองเจ๊ก ตัวเล็กเสียงดัง",
        "correct": "ประทัด"
    },
    {
        "Title": "อะไรเอ่ย หลังคาติดกับตัว โผล่หัวออกนอกชายคา",
        "correct": "เต่า"
    },
    {
        "Title": "อะไรเอ่ย ตัดโคนก็ไม่ตาย ตัดปลายก็ไม่เน่า",
        "correct": "ผม"
    },
    {
        "Title": "อะไรเอ่ย ซื้อมาเป็นสีดำ นำมาใช้กลายเป็นสีแดง พอสิ้นแรง กลายเป็นสีเทา ต้องเอาไปทิ้ง",
        "correct": "ถ่าน"
    },
    {
        "Title": "อะไรเอ่ย ยิ่งตัดยิ่งยาว",
        "correct": "ถนน"
    },
    {
        "Title": "อะไรเอ่ย แหวนกับแหวน ชนกันที่หันอากาศ เกิดเป็นสัตว์ประหลาดชอบกินหญ้า",
        "correct": "วัว"
    },
    {
        "Title": "อะไรเอ่ย เวลาใช้เอาไปทิ้ง เวลาไม่ใช้เอาไปเก็บ",
        "correct": "สมอเรือ"
    },
    {
        "Title": "อะไรเอ่ย เช้า ๆ เข้าถ้ำ ค่ำ ๆ ออกมาเรียง",
        "correct": "ดาว"
    },
    {
        "Title": "อะไรเอ่ย มีลูกอยู่ที่ตีน มีตารอบตัว มีหูอยู่บนหัว",
        "correct": "แห"
    },
    {
        "Title": "อะไรเอ่ย เขียวชะอุ่ม พุ่มไสว ไม่มีใบมีแต่เม็ด",
        "correct": "ฝน"
    },
    {
        "Title": "อะไรเอ่ย ชักออกมาดำ ตำเข้าไปแดง มีแสงไฟ",
        "correct": "ไม้ขีดไฟ"
    },
    {
        "Title": "อะไรเอ่ย เวลาเรานอนมันยืน เวลาเรายืนมันนอน",
        "correct": "เท้า"
    },
    {
        "Title": "อะไรเอ่ย นกอะไรที่ไม่ใช่ของเรา",
        "correct": "นกเขา"
    },
    {
        "Title": "อะไรเอ่ย สี่ตีนเชื่อง ๆ ไม่มุงกระเบื้องแต่มุงเข็ม",
        "correct": "เม่น"
    },
    {
        "Title": "อะไรเอ่ย ลูกสัปดน เล่นก้นแม่",
        "correct": "ลูกกุญแจ"
    },
    {
        "Title": "อะไรเอ่ย เกิดมามีหางไม่มีขา พอสิ้นชีวามีแต่ขาไม่มีหาง",
        "correct": "กบ"
    },
    {
        "Title": "อะไรเอ่ย มีปากไม่มีฟัน กินข้าวทุกวันได้มากกว่าคน",
        "correct": "หม้อข้าว"
    },
    {
        "Title": "อะไรเอ่ย ไม่มีคอ มีแต่หัว มีแต่หน้า ถึงเวลาตีได้ตีเอา",
        "correct": "กลอง"
    },
    {
        "Title": "อะไรเอ่ย สองหูสี่ตา เบื่อนักหนาเอาขาไว้ที่หู",
        "correct": "แว่นตา"
    },
    {
        "Title": "อะไรเอ่ย สองปีกหัวหก มีสองบาทา ยามทิวาพักผ่อน ยามราตรีออกหากิน",
        "correct": "ค้างคาว"
    },
    {
        "Title": "อะไรเอ่ย บิดหัวน้ำตาไหลคนชอบใช้กันทั่วเมือง",
        "correct": "ก๊อกน้ำ"
    },
    {
        "Title": "อะไรเอ่ย ต้นเท่าขา ใบวาเดียว",
        "correct": "ต้นกล้วย"
    },
    {
        "Title": "อะไรเอ่ย ต้นเท่าครก ใบปรกดิน",
        "correct": "ตะไคร้"
    },
    {
        "Title": "อะไรเอ่ย เปิดผ้าเห็นขน แกะขนเห็นเม็ด แกะเม็ดเห็นรู",
        "correct": "ข้าวโพด"
    },
    {
        "Title": "อะไรเอ่ย ทุกครั้งที่กางขา ต้องอ้าปากทุกที",
        "correct": "กรรไกร"
    },
    {
        "Title": "อะไรเอ่ย ใบหยักๆ ลูกรักเต็มคอ",
        "correct": "มะละกอ"
    },
];