var questions = [{
        "choice1": "แก",
        "choice2": "เกะ",
        "choice3": "แกะ",
        "choice4": "เกอะ",
        "correct": "3",
        "Title": "ก + แ-ะ = ?"
    },
    {
        "choice1": "นาดี",
        "choice2": "ดูปู",
        "choice3": "ปะจุ",
        "choice4": "ธุระ",
        "correct": "2",
        "Title": "ข้อใดประสมด้วยสระอู"
    },
    {
        "choice1": "ยาว",
        "choice2": "สั้น",
        "choice3": "กลาง",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "2",
        "Title": "เตะ ออกเสียงสั้นหรือเสียงยาว"
    },
    {
        "choice1": "1 คำ",
        "choice2": "2 คำ",
        "choice3": "3 คำ",
        "choice4": "4 คำ",
        "correct": "3",
        "Title": "<b>''ตามาหารูปู''</b> มีคำที่สะกดด้วยสระอากี่คำ"
    },
    {
        "choice1": "สวม",
        "choice2": "ใส่",
        "choice3": "นุ่ง",
        "choice4": "ถอด",
        "correct": "1",
        "Title": "เลือกเติมคำในช่องว่างให้ได้ใจความเหมาะสม <br><b>''น้อยหน่า.................เสื้อและกางเกงใหม่''</b>"
    },
    {
        "choice1": "สุภาพ - อ่อนน้อม",
        "choice2": "ยิ้มแย้ม - เศร้าซึม",
        "choice3": "อ่อนแอ - แข็งแกร่ง",
        "choice4": "สดใส-ซึมเศร้า",
        "correct": "1",
        "Title": "เลือกข้อที่มีความหมายคล้ายกัน"
    },
    {
        "choice1": "ปลา - แม่น้ำ",
        "choice2": "ถุงเท้า - กระเป๋า",
        "choice3": "ไข่ - แม่ไก่",
        "choice4": "ต้นไม้-กระถาง",
        "correct": "2",
        "Title": "คำคู่ใด ไม่เกี่ยวข้องกัน"
    },
    {
        "choice1": "1 คำ",
        "choice2": "2 คำ",
        "choice3": "3 คำ",
        "choice4": "4 คำ",
        "correct": "2",
        "Title": "<b>''สมชายกินข้าวมันไก่''</b> มีคำที่มี น สะกดอยู่กี่คำ"
    },
    {
        "choice1": "ข้างล่าง",
        "choice2": "วังเวง",
        "choice3": "โขลงช้าง",
        "choice4": "ข้าวแกง",
        "correct": "4",
        "Title": "ข้อใดมีตัวสะกดต่างจากพวก"
    },
    {
        "choice1": "ด้าน - ค้าน",
        "choice2": "เป้า - ป่าว",
        "choice3": "เงา - เหงา",
        "choice4": "คี่ - ขี้",
        "correct": "4",
        "Title": "ข้อใดที่อ่านออกเสียงเหมือนกัน"
    },
    {
        "choice1": "คำขวัญ",
        "choice2": "นิทาน",
        "choice3": "ปริศนาคำทาย",
        "choice4": "สุภาษิต",
        "correct": "3",
        "Title": "<b>''อะไรเอ่ย สี่ตีนเดินมาหลังคามุงกระเบื้อง''</b><br> จากข้อความจัดอยู่ในประเภทใด"
    },
    {
        "choice1": "ข้าว ฉัน กิน",
        "choice2": "ฉัน ข้าว กิน",
        "choice3": "ฉัน กิน ข้าว",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "3",
        "Title": "ข้อใดเรียงประโยคถูกต้อง <b>''กิน ข้าว ฉัน''</b>"
    },
    {
        "choice1": "โรงเรียน ฉัน ไป",
        "choice2": "ฉัน ไป โรงเรียน",
        "choice3": "ฉัน โรงเรียน ไป",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "2",
        "Title": "ข้อใดเรียงประโยคถูกต้อง <b>''โรงเรียน ฉัน ไป''</b>"
    },
    {
        "choice1": "3 คำ 1 พยางค์",
        "choice2": "3 คำ 3 พยางค์",
        "choice3": "2 คำ 3 พยางค์",
        "choice4": "1 คำ 3 พยางค์",
        "correct": "4",
        "Title": "<b>''หนังสือพิมพ์''</b> มีกี่คำ กี่พยางค์"
    },
    {
        "choice1": "แม่ไปตลาดบ่อย",
        "choice2": "แม่ไปตลาดบ่อยๆ",
        "choice3": "บ่อยๆ แม่ไปตลาด",
        "choice4": "แม่ๆ ไปตลาดบ่อย",
        "correct": "2",
        "Title": "<b>''แม่ไปตลาดบ่อยบ่อย''</b> เขียนอย่างไร"
    },
    {
        "choice1": "8 ขา",
        "choice2": "6 ขา",
        "choice3": "4 ขา",
        "choice4": "2 ขา",
        "correct": "3",
        "Title": "หมามีกี่ขา"
    },
    {
        "choice1": "อยาก อย่า ย้าย อย่าง",
        "choice2": "อย่า อยู่ ยาก อย่าง",
        "choice3": "อย่า ย่าง ยาย อยู่",
        "choice4": "อย่าง อยู่ อยาก อย่า",
        "correct": "4",
        "Title": "ข้อใดเป็นอักษร อ นำ ย ทั้งหมด"
    },
    {
        "choice1": "42 ตัว",
        "choice2": "44 ตัว",
        "choice3": "46 ตัว",
        "choice4": "48 ตัว",
        "correct": "2",
        "Title": "พยัญชนะไทยมีทั้งหมดกี่ตัว"
    },
    {
        "choice1": "พอ - ออ - ลอ - พล",
        "choice2": "พอ - ออ - นอ - พร",
        "choice3": "พอ - ออ - รอ - พอน",
        "choice4": "พอ - ออ - รอ - พร",
        "correct": "4",
        "Title": "ข้อใดอ่านถูกต้อง"
    },
    {
        "choice1": "ไบ",
        "choice2": "ใบ",
        "choice3": "โบ",
        "choice4": "บัย",
        "correct": "2",
        "Title": "<b>''มีบัวอยู่ชนิดหนึ่งที่มี......ใหญ่เท่ากระด้ง สามารถให้คนเข้าไปยืนบนนั้นได้''</b> ในช่องว่างควรเติมคำตอบใด"
    },
    {
        "choice1": "สะใภ้",
        "choice2": "ผู้ใหญ่",
        "choice3": "ดีใจ",
        "choice4": "ไหว้พระ",
        "correct": "4",
        "Title": "ข้อใดที่ไม่ได้ใช้สระเหมือนคำอื่น"
    },
    {
        "choice1": "สถานีตำรวจ",
        "choice2": "สถานีรถไฟ",
        "choice3": "สถานีอนามัย",
        "choice4": "สถานีรถประจำทาง",
        "correct": "3",
        "Title": "ข้อใดเป็นคำ 6 พยางค์"
    },
    {
        "choice1": "โ-",
        "choice2": "-า",
        "choice3": "-แ",
        "choice4": "-ะ",
        "correct": "4",
        "Title": "ข้อใดเป็นสระเสียงสั้น"
    },
    {
        "choice1": "ตามาหาอา",
        "choice2": "ตามาหาอีกา",
        "choice3": "ในนามีอีกา",
        "choice4": "อาไปหาตา",
        "correct": "1",
        "Title": "ข้อใดประสมด้วยสระ -า ทั้งหมด"
    },
    {
        "choice1": "ข้างบน",
        "choice2": "ข้างหลัง",
        "choice3": "ข้างล่าง",
        "choice4": "ข้างหน้า",
        "correct": "4",
        "Title": "สระโอ เขียนไว้ตรงไหนของพยัญชนะ"
    },
    {
        "choice1": "-อ",
        "choice2": "-า",
        "choice3": "-ะ",
        "choice4": "โ-",
        "correct": "1",
        "Title": "สระตัวใดเขียนไว้ข้างหน้าพยัญชนะ"
    },
    {
        "choice1": "เสียงสามัญ และ เสียงตรี",
        "choice2": "เสียงเอก และ เสียงโท",
        "choice3": "เสียงจัตวา และ เสียงโท",
        "choice4": "เสียงจัตวา และ เสียงตรี",
        "correct": "4",
        "Title": "คำว่า <b>''ขาวจั๊วะ''</b> มีเสียงวรรณยุกต์ใด"
    },
    {
        "choice1": "เรือใบ",
        "choice2": "เพลินใจ",
        "choice3": "ของใช้",
        "choice4": "เผื่อแผ่",
        "correct": "2",
        "Title": "ข้อใดมีคำที่ประสมด้วยสระ เ-อ และสระ ใ-"
    },
    {
        "choice1": "เรือใบ",
        "choice2": "เพลินใจ",
        "choice3": "ของใช้",
        "choice4": "เผื่อแผ่",
        "correct": "2",
        "Title": "ข้อใดมีคำที่ประสมด้วยสระ เ-อ และสระ ใ-"
    },
    {
        "choice1": "กะ - ตา",
        "choice2": "บ้าน - โต๊ะ",
        "choice3": "แก - แกะ",
        "choice4": "เตะ - แตะ",
        "correct": "4",
        "Title": "ข้อใดเป็นคำที่มีสระเสียงสั้นทั้งหมด"
    },
    {
        "choice1": "ไม้เอก เป็น ลูกบ่วย",
        "choice2": "ไม้โท เป็น ลูกบ้วย",
        "choice3": "ไม้ตรี เป็น ลูกบ๊วย",
        "choice4": "ไม้จัตวา เป็น ลูกบ๋วย",
        "correct": "3",
        "Title": "คำว่า <b>''ลูกบวย''</b> ควรเติมเครื่องหมายวรรณยุกต์ให้คำถูกต้องและมีความหมาย"
    }
];

var questions2 = [{
        "choice1": "6 พยางค์",
        "choice2": "7 พยางค์",
        "choice3": "8 พยางค์",
        "choice4": "9 พยางค์",
        "correct": "3",
        "Title": "เมื่อนั้น โฉมจันท์<u>กัลยามารศรี</u> <b>''ข้อความที่ขีดเส้นใต้มีกี่พยางค์''</b>"
    },
    {
        "choice1": "สุกเกษมสานต์",
        "choice2": "สุขเกษมศาน",
        "choice3": "สุขเกษมศานต์",
        "choice4": "สุขเกษมสานต์",
        "correct": "3",
        "Title": "<b>''สุก - กะ - เสม - สาน''</b> คำอ่านนี้เขียนอย่างไร"
    },
    {
        "choice1": "ตายแล้วลามาเกิด",
        "choice2": "มาเกิดแล้วตาย",
        "choice3": "เกิดแล้วไปตายใหม่",
        "choice4": "ถูกทุกข้อ",
        "correct": "1",
        "Title": "<b>''จุ - ติ''</b> อ่านว่า จุติ คำนี้แปลว่าอะไร"
    },
    {
        "choice1": "2 พยางค์",
        "choice2": "3 พยางค์",
        "choice3": "4 พยางค์",
        "choice4": "5 พยางค์",
        "correct": "3",
        "Title": "<b>''พบสองเฒ่าปลูกถั่วงา นางนั่งวันทาขมีขมัน''</b> คำว่า ขมีขมัน ออกเสียงกี่พยางค์"
    },
    {
        "choice1": "คำเรียก",
        "choice2": "คำแทน",
        "choice3": "คำแสดงอาการ",
        "choice4": "คำสร้อย",
        "correct": "1",
        "Title": "คำนามเรียกอีกอย่างหนึ่งว่าอะไร"
    },
    {
        "choice1": "อัน",
        "choice2": "เล่ม",
        "choice3": "ลำ",
        "choice4": "แท่ง",
        "correct": "2",
        "Title": "คำว่า <b>''หนังสือ'/b'> มีลักษณนามว่าอย่างไร"
    },
    {
        "choice1": "ปรัศนี",
        "choice2": "อัศเจรีย์",
        "choice3": "วิสรรชนีย์",
        "choice4": "สัญประกาศ",
        "correct": "1",
        "Title": "เครื่องหมาย (?) มีชื่อเรียกว่าอะไร"
    },
    {
        "choice1": "? = สัญประกาศ",
        "choice2": "! = อัศเจรีย์",
        "choice3": ". = มหัพภาค",
        "choice4": "''  '' = อัญประกาศ",
        "correct": "1",
        "Title": "ข้อใดผิด"
    },
    {
        "choice1": "(  )",
        "choice2": "ๆ",
        "choice3": "=",
        "choice4": "!",
        "correct": "4",
        "Title": "<b>''โอ้โห เธองามจริงๆ''</b> ใช้เครื่องหมายวรรคตอนใด"
    },
    {
        "choice1": "ดช.",
        "choice2": "ดญ.",
        "choice3": "กทม.",
        "choice4": "พค.",
        "correct": "3",
        "Title": "ข้อใดใช้ (.) ได้ถูกต้อง"
    },
    {
        "choice1": "เล่นเกมส์",
        "choice2": "เล่นเกมศ์",
        "choice3": "เล่นเกมษ์",
        "choice4": "เล่นเกม",
        "correct": "4",
        "Title": "คำในข้อใดเขียนถูกต้อง"
    },
    {
        "choice1": "เล่นเกม",
        "choice2": "คอมพิวเตอร์",
        "choice3": "วรรณคดี",
        "choice4": "หงุดหงิด",
        "correct": "1",
        "Title": "คำใดมีลักษณะเป็นคำไทยแท้"
    },
    {
        "choice1": "หัวเสีย",
        "choice2": "หน้าทะเล้น",
        "choice3": "รักชาติ",
        "choice4": "โรงเรียน",
        "correct": "2",
        "Title": "คำประสมใดที่เกิดจากคำนามและคำวิเศษณ์ประสมกัน"
    },
    {
        "choice1": "วัน + คดี",
        "choice2": "วรรณ + คะ + ดี",
        "choice3": "วรรณ + คดี",
        "choice4": "วรรณะ + คดี",
        "correct": "4",
        "Title": "<b>''วรรณคดี''</b> เกิดจากรากศัพท์ของบาลีสันสกฤตคำใดที่สมาสกัน"
    },
    {
        "choice1": "อักษรควบ",
        "choice2": "อักษรนำ",
        "choice3": "คำประสม",
        "choice4": "คำซ้ำ",
        "correct": "2",
        "Title": "<b>''หงุดหงิด''</b> มีลักษณะคำอยู่ในคำตอบข้อใด"
    },
    {
        "choice1": "คนเราต้องปรึกษาหารือกันบ้าง",
        "choice2": "สามีชอบตะคอกข่มขืนใจให้ภรรยาเสียใจ",
        "choice3": "เขาชอบทำเสียงโหวกเหวกอยู่ในลำคอ",
        "choice4": "เธอมีเรื่องขัดข้องหมองมัวอะไรอยู่ในใจ",
        "correct": "1",
        "Title": "คำซ้อนในข้อใดสอดคล้องกับบริบทในคำตอบ"
    },
    {
        "choice1": "ตายไป",
        "choice2": "ตายจาก",
        "choice3": "วายวอด",
        "choice4": "กลายจาก",
        "correct": "2",
        "Title": "<b>''ล้มหาย...................''</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "ยามร้าย",
        "choice2": "ยามดี",
        "choice3": "ยามเย็น",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "1",
        "Title": "<b>''เคราะห์หาม..................''</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "ภาคเหนือ",
        "choice2": "ภาคใต้",
        "choice3": "ภาคอีสาน",
        "choice4": "ภาคตะวันออก",
        "correct": "2",
        "Title": "เกาะหนู เกาะแมว เป็นนิทานทางภาคใด"
    },
    {
        "choice1": "สุราษฎร์ธานี",
        "choice2": "สงขลา",
        "choice3": "ยะลา",
        "choice4": "พะเยา",
        "correct": "2",
        "Title": "เรื่องเกาะหนู เกาะแมว เป็นนิทานที่เล่ากันในจังหวัดใด"
    },
    {
        "choice1": "คำนาม",
        "choice2": "คำสรรพนาม",
        "choice3": "คำกิริยา",
        "choice4": "คำวิเศษณ์",
        "correct": "2",
        "Title": "คำที่ใช้แทนชื่อคน สัตว์ สิ่งของ สถานที่ เป็นคำชนิดใด"
    },
    {
        "choice1": "จำนง   ซาบซึ้ง",
        "choice2": "ประทับ  เวทมนตร์",
        "choice3": "ก๋วยเตี๋ยว  เครื่องราง",
        "choice4": "ยาเสพติด  พิษภัย",
        "correct": "3",
        "Title": "คำในข้อใดประสมด้วยสระเสียงยาวทุกคำ"
    },
    {
        "choice1": "ตีนคู้",
        "choice2": "ฟันหนู",
        "choice3": "ลากข้าง",
        "choice4": "พินทุ",
        "correct": "1",
        "Title": "คำว่า <b>''ตู้''</b> มีรูปสระใดประสมอยู่"
    },
    {
        "choice1": "นั่งก้มหน้า",
        "choice2": "ถามคำถาม",
        "choice3": "คุยกันเบาๆ",
        "choice4": "ตั้งใจฟัง",
        "correct": "4",
        "Title": "ขณะคุณครูพูด นักเรียนควรปฏิบัติอย่างไร"
    },
    {
        "choice1": "วัว",
        "choice2": "พัด",
        "choice3": "ถั่ว",
        "choice4": "ตัว",
        "correct": "2",
        "Title": "ข้อใดอ่านออกเสียงสระ อะ"
    },
    {
        "choice1": "ลูกชาย  เลือดหมู",
        "choice2": "เจ็บป่วย  อาหาร",
        "choice3": "กางร่ม  วิ่งแข่ง",
        "choice4": "ร่างกาย  กลางวัน",
        "correct": "1",
        "Title": "ข้อใดประสมสระแบบคงรูปทุกคำ"
    },
    {
        "choice1": "ไข้",
        "choice2": "ไหม้",
        "choice3": "ร้าน",
        "choice4": "ไส้",
        "correct": "3",
        "Title": "ข้อใดอ่านออกเสียงวรรณยุกต์ ต่างจากคำว่า “บ้าน”"
    },
    {
        "choice1": "แข็ง",
        "choice2": "เป็น",
        "choice3": "เจ็บ",
        "choice4": "เค็ม",
        "correct": "1",
        "Title": "ข้อใดออกเสียงสระต่างจากข้ออื่น"
    },
    {
        "choice1": "1 คำ",
        "choice2": "2 คำ",
        "choice3": "3 คำ",
        "choice4": "4 คำ",
        "correct": "4",
        "Title": "“ปลูกเผือก ผักกาด หญ้าแพรก” คำที่อ่านออกเสียง แม่กก มีกี่คำ"
    },
    {
        "choice1": "กว้างขวาง เพลงดัง",
        "choice2": "งบดุล ผลัดเวร",
        "choice3": "สงสาร ลูกกรง",
        "choice4": "โรงหนัง กังวาน",
        "correct": "1",
        "Title": "คำในข้อใดมีตัวสะกดในมาตราเดียวกัน"
    },
    {
        "choice1": "มะม่วง เอือมระอา",
        "choice2": "กมล ขนม",
        "choice3": "ชวนชม กลมกล่อม",
        "choice4": "ตรมตรอม หยุมหยิม",
        "correct": "4",
        "Title": "คำในข้อใดมีตัวสะกดในมาตราเดียวกัน"
    },
    {
        "choice1": "ศิลปะ วิปลาส",
        "choice2": "ฉบับ ตลบ",
        "choice3": "ระเห็จ มลทิน",
        "choice4": "บรรทุก บรรจบ",
        "correct": "2",
        "Title": "คำในข้อใดมีตัวสะกดในมาตราเดียวกัน"
    },
    {
        "choice1": "ไข่มุก คอนกรีต",
        "choice2": "เกสร บาป",
        "choice3": "วิหค คลินิก",
        "choice4": "สงสาร ผักกาด",
        "correct": "3",
        "Title": "คำในข้อใดมีตัวสะกดในมาตราเดียวกัน"
    },
    {
        "choice1": "ซากศพ",
        "choice2": "ธรรมชาติ",
        "choice3": "โกหก",
        "choice4": "พกลม",
        "correct": "4",
        "Title": "ข้อใดมีตัวสะกดมาตราเดียวกับคำว่า ภาคภูมิ"
    },
    {
        "choice1": "ภาคเรียน",
        "choice2": "ภูมิใจ",
        "choice3": "งานเขียน",
        "choice4": "เชี่ยวชาญ",
        "correct": "1",
        "Title": "ข้อใดมีตัวสะกดมาตราเดียวกับคำว่า พากเพียร"
    },
    {
        "choice1": "ขอบใจจ้ะ",
        "choice2": "ขอบคุณครับ/ค่ะ",
        "choice3": "ขอบพระคุณครับ/ค่ะ",
        "choice4": "กราบขอบพระคุณครับ/ค่ะ",
        "correct": "4",
        "Title": "ถ้าเราจะกล่าวขอบคุณพระสงฆ์ควรใช้คำพูดว่าอย่างไร"
    },
    {
        "choice1": "ขอบใจ",
        "choice2": "ขอบคุณนะ",
        "choice3": "ขอบพระคุณครับ",
        "choice4": "เป็นพระมหากรุณาธิคุณอย่างสูง",
        "correct": "3",
        "Title": "คุณพ่อให้เงินสมคิดไปโรงเรียน สมคิดควรกล่าวคำว่าอะไร"
    },
    {
        "choice1": "ชงโค",
        "choice2": "ชะเอม",
        "choice3": "ชวนชม",
        "choice4": "ชมพู่",
        "correct": "1",
        "Title": "ถ้าเรียงลำดับตามพจนานุกรมคำในข้อใดอยู่ลำดับแรกสุด"
    },
    {
        "choice1": "โรคภัย ไข้หวัด",
        "choice2": "เช้ามืด ปีใหม่",
        "choice3": "ศีรษะ ห้องสีขาว",
        "choice4": "สาวสวย รำพึง",
        "correct": "3",
        "Title": "ข้อใดมีพยัญชนะต้นเป็นอักษรสูงทั้งหมด"
    },
    {
        "choice1": "ปาท๋องโก๋",
        "choice2": "เป็ด",
        "choice3": "ปลื้ม",
        "choice4": "ปิงปอง",
        "correct": "2",
        "Title": "ถ้าเรียงลำดับตามพจนานุกรมคำในข้อใดอยู่ลำดับท้ายสุด"
    },
    {
        "choice1": "กางเกง  กอง  ไก่เตี้ย  กำแพง",
        "choice2": "กำแพง  กอง  กางเกง  ไก่เตี้ย",
        "choice3": "ไก่เตี้ย  กอง  กางเกง  กำแพง",
        "choice4": "กอง  กางเกง  กำแพง  ไก่เตี้ย",
        "correct": "4",
        "Title": "ข้อใดเรียงลำดับคำตามพจนานุกรมได้ถูกต้อง"
    },
    {
        "choice1": "นิ",
        "choice2": "ดู",
        "choice3": "โต",
        "choice4": "จะ",
        "correct": "1",
        "Title": "ข้อใดเป็นพยางค์เพียงอย่างเดียว"
    },
    {
        "choice1": "ผลิต",
        "choice2": "มรรยาท",
        "choice3": "กรรมสิทธิ์",
        "choice4": "กลไก",
        "correct": "3",
        "Title": "ข้อใดมี 3 พยางค์"
    },
    {
        "choice1": "4 คำ  4  พยางค์",
        "choice2": "3 คำ  5  พยางค์",
        "choice3": "5 คำ  4  พยางค์",
        "choice4": "5 คำ  5  พยางค์",
        "correct": "2",
        "Title": "“ผักคะน้าต้นใหญ่” วลีนี้มีกี่คำ กี่พยางค์"
    },
    {
        "choice1": "1 คำ  1 พยางค์",
        "choice2": "4 คำ  4  พยางค์",
        "choice3": "4 คำ  1  พยางค์",
        "choice4": "1 คำ  4  พยางค์",
        "correct": "4",
        "Title": "“หนังสือการ์ตูน” วลีนี้มีกี่คำ กี่พยางค์"
    },
    {
        "choice1": "รัฐสภา",
        "choice2": "ตุ๊กตา",
        "choice3": "นามธรรม",
        "choice4": "โฆษณา",
        "correct": "1",
        "Title": "ข้อใดมีพยางค์ต่างจากข้ออื่น"
    },
    {
        "choice1": "ดนัยวิ่งเร็ว",
        "choice2": "น้องร้องไห้",
        "choice3": "ฉันกิน",
        "choice4": "ฝนตกหนัก",
        "correct": "3",
        "Title": "ข้อใดต่างจากข้ออื่น"
    },
    {
        "choice1": "อย่าไปเล่นกลางถนน",
        "choice2": "แม่ค้าขายผัก",
        "choice3": "ฉันไม่ชอบสุนัข",
        "choice4": "ใครไปทะเล",
        "correct": "2",
        "Title": "ข้อใดเป็นประโยคบอกเล่า"
    },
    {
        "choice1": "ทำไมถึงมาที่นี่",
        "choice2": "อะไรที่ทำให้เธอเป็นแบบนี้",
        "choice3": "ใครจะไปเที่ยวก็ได้",
        "choice4": "ฉันควรทำอย่างไรดี",
        "correct": "3",
        "Title": "ข้อใดไม่ใช่ประโยคคำถาม"
    },
    {
        "choice1": "ประโยคบอกเล่า",
        "choice2": "ประโยคขอร้อง",
        "choice3": "ประโยคคำสั่ง",
        "choice4": "ประโยคปฏิเสธ",
        "correct": "3",
        "Title": "<b>''จงแต่งประโยคจากคำที่กำหนดให้''</b> เป็นประโยคประเภทใด"
    }
];

var questions3 = [{
        "choice1": "อดออม พุทรา",
        "choice2": "ฎีกา บัวตอง",
        "choice3": "แกงไก่ ผ้าใบ",
        "choice4": "ยางลบ สวดมนต์",
        "correct": "2",
        "Title": "ข้อใดมีพยัญชนะต้นเป็นอักษรกลางทั้งหมด"
    },
    {
        "choice1": "เคารพ สมุด",
        "choice2": "หีบห่อ ดำรง",
        "choice3": "ประดิษฐ์ วิเศษ",
        "choice4": "ชุมนุม ระวัง",
        "correct": "4",
        "Title": "ข้อใดมีพยัญชนะต้นเป็นอักษรต่ำทั้งหมด"
    },
    {
        "choice1": "ธนบัตร พิจิตร",
        "choice2": "ดาดฟ้า ทยอย",
        "choice3": "ศักดิ์ศรี  รามเกียรติ์",
        "choice4": "คิดเห็น ก้อนหิน",
        "correct": "1",
        "Title": "คำในข้อใด  ประสมด้วยสระเสียงสั้นทุกคำ"
    },
    {
        "choice1": "จำนง ซาบซึ้ง",
        "choice2": "ประทับ เวทมนตร์",
        "choice3": "ก๋วยเตี๋ยว เครื่องราง",
        "choice4": "ยาเสพติด พิษภัย",
        "correct": "3",
        "Title": "คำในข้อใดประสมด้วยสระเสียงยาวทุกคำ"
    },
    {
        "choice1": "ไม้หน้า",
        "choice2": "ไม้โอ",
        "choice3": "ไม้ผัด",
        "choice4": "ไม้ไต่คู้",
        "correct": "2",
        "Title": "สระ โ-  มีชื่อเรียกรูปสระว่าอย่างไร"
    },
    {
        "choice1": "ไม้ผัด และ ฟันหนู",
        "choice2": "หยาดน้ำค้าง และ ฟันหนู",
        "choice3": "พินทุ และ ตีนเหยียด",
        "choice4": "พินทุ และ ฝนทอง",
        "correct": "4",
        "Title": "คำว่า  <b>“ดี”</b> มีรูปสระใดประสมอยู่"
    },
    {
        "choice1": "รูปวรรณยุกต์โท  เสียงวรรณยุกต์เอก",
        "choice2": "รูปวรรณยุกต์โท  เสียงวรรณยุกต์โท",
        "choice3": "รูปวรรณยุกต์เอก  เสียงวรรณยุกต์โท",
        "choice4": "รูปวรรณยุกต์เอก  เสียงวรรณยุกต์เอก",
        "correct": "3",
        "Title": "คำว่า <b>“ค่า”</b> มีรูปวรรณยุกต์ และเสียงวรรณยุกต์ใด"
    },
    {
        "choice1": "โบราณ แข่งขัน",
        "choice2": "มะละกอ นาฬิกา",
        "choice3": "หนทาง กางเกง",
        "choice4": "กักกัน เดินเหิน",
        "correct": "4",
        "Title": "ข้อใดประสมสระแบบแปลงรูปทุกคำ"
    },
    {
        "choice1": "ทัพพี รูปภาพ",
        "choice2": "วงกลม สมภพ",
        "choice3": "สุนัข ปักเป้า",
        "choice4": "การบ้าน เฉยเมย",
        "correct": "2",
        "Title": "ข้อใดประสมสระแบบลดรูปทุกคำ"
    },
    {
        "choice1": "ไม่",
        "choice2": "ใคร่",
        "choice3": "ไข้",
        "choice4": "ใช้",
        "correct": "4",
        "Title": "ข้อใดอ่านออกเสียงวรรณยุกต์ ต่างจากข้ออื่น"
    },
    {
        "choice1": "ขัน",
        "choice2": "ผัน",
        "choice3": "ตัว",
        "choice4": "ฟัน",
        "correct": "3",
        "Title": "ข้อใดอ่านออกเสียงสระแตกต่างจากข้ออื่น"
    },
    {
        "choice1": "หา",
        "choice2": "สี",
        "choice3": "ปู",
        "choice4": "เสียง",
        "correct": "4",
        "Title": "ข้อใดต่างจากข้ออื่น"
    },
    {
        "choice1": "1 คำ",
        "choice2": "2 คำ",
        "choice3": "3 คำ",
        "choice4": "4 คำ",
        "correct": "2",
        "Title": "<b>“รื่นรมย์ สมอุรา”</b> ข้อความนี้มีคำที่สะกดด้วยแม่กมกี่คำ"
    },
    {
        "choice1": "แม่กง",
        "choice2": "แม่กม",
        "choice3": "แม่กก",
        "choice4": "แม่กบ",
        "correct": "4",
        "Title": "คำว่า <b>“สาป”</b> อยู่ในมาตราตัวสะกดใด"
    },
    {
        "choice1": "ทูต ประโยชน์",
        "choice2": "ตำรวจ อาจ",
        "choice3": "พาล พิษ",
        "choice4": "ขอโทษ รถ",
        "correct": "3",
        "Title": "คำในข้อใดมีมาตราตัวสะกดต่างจากข้ออื่น"
    },
    {
        "choice1": "แม่กก",
        "choice2": "แม่กบ",
        "choice3": "แม่กด",
        "choice4": "แม่กน",
        "correct": "4",
        "Title": "บุญคุณ มีตัวสะกดมาตราใด"
    },
    {
        "choice1": "ทรัพย์",
        "choice2": "อภัย",
        "choice3": "เขียว",
        "choice4": "ขยำ",
        "correct": "2",
        "Title": "คำในข้อใดมีตัวสะกดตรงกับคำว่า ขโมย"
    },
    {
        "choice1": "ตูมตาม",
        "choice2": "วัวนม",
        "choice3": "บัวขาว",
        "choice4": "หงุดหงิด",
        "correct": "3",
        "Title": "ข้อใดสะกดด้วย แม่เกอว"
    },
    {
        "choice1": "ว + แ – + น + –่  = วแน่",
        "choice2": "พ + –อ + ร = พอร",
        "choice3": "คร + โ–ะ + ก = ครก",
        "choice4": "ก + –า + ง + –้ = กาง้",
        "correct": "3",
        "Title": "ข้อใดเขียนประสมคำถูกต้อง"
    },
    {
        "choice1": "ส + –ะ + ต + ว์ = สะตว์",
        "choice2": "พ + โ–ะ + ล =  โพล",
        "choice3": "ย + โ–ะ + ก = โยก",
        "choice4": "บ + –า + น + –้ = บ้าน",
        "correct": "3",
        "Title": "ข้อใดเขียนประสมคำถูกต้อง"
    },
    {
        "choice1": "กลม = ก + –ะ + ล + ม",
        "choice2": "ขบถ = ข + บ + ถ",
        "choice3": "ชมพู  = ช + ม + พ + –ู",
        "choice4": "สวน = ส + –-ัว + น",
        "correct": "4",
        "Title": "ข้อใดเขียนกระจายคำถูกต้อง"
    },
    {
        "choice1": "คำนำ",
        "choice2": "สารบัญ",
        "choice3": "เนื้อเรื่อง",
        "choice4": "สรุป",
        "correct": "2",
        "Title": "ข้อใดไม่ใช่ส่วนประกอบของเรียงความ"
    },
    {
        "choice1": "ชื่อเรื่อง",
        "choice2": "คำนำ",
        "choice3": "เนื้อเรื่อง",
        "choice4": "สรุป",
        "correct": "3",
        "Title": "ส่วนประกอบที่สำคัญที่สุดของเรียงความคือข้อใด"
    },
    {
        "choice1": "มีองค์ประกอบครบ 3 ส่วน",
        "choice2": "ใช้สำนวนภาษาสละสลวย",
        "choice3": "มีเนื้อหายาวหลายหน้า",
        "choice4": "ให้ข้อคิดที่สร้างสรรค์",
        "correct": "3",
        "Title": "ข้อใดไม่ใช่ลักษณะของเรียงความที่ดี"
    },
    {
        "choice1": "นั่งในท่าที่สบายไม่เกร็ง",
        "choice2": "เขียนพยัญชนะจรดเส้นบรรทัดบน – ล่าง",
        "choice3": "เว้นระยะช่องไฟให้เท่ากันและสม่ำเสมอ",
        "choice4": "จับดินสอให้แน่นๆ และกดเต็มแรง",
        "correct": "4",
        "Title": "ข้อใดคือการคัดลายมือไม่ถูกวิธี"
    },
    {
        "choice1": "เรากินข้าว",
        "choice2": "พ่อช่วยดูแลธนา",
        "choice3": "ที่นี่กรุงเทพฯ",
        "choice4": "ฉันชอบปลูกดอกไม้",
        "correct": "3",
        "Title": "ข้อใดเป็นกลุ่มคำ"
    },
    {
        "choice1": "ข่าวภาคดึก",
        "choice2": "มนุษย์ยุคหิน",
        "choice3": "ท้องฟ้าสีคราม",
        "choice4": "เรือลอยอยู่ในทะเล",
        "correct": "4",
        "Title": "ข้อใดเป็นประโยค"
    },
    {
        "choice1": "แม่",
        "choice2": "ตี",
        "choice3": "ยุง",
        "choice4": "ตาย",
        "correct": "3",
        "Title": "<b>“แม่ตียุงตาย”</b> ข้อใดคือกรรม"
    },
    {
        "choice1": "หมา",
        "choice2": "หมาของป้า",
        "choice3": "กำลังแทะ",
        "choice4": "กำลังแทะกระดูก",
        "correct": "2",
        "Title": "<b>“หมาของป้ากำลังแทะกระดูก”</b> ข้อใดคือภาคประธานของประโยค"
    },
    {
        "choice1": "เธอ",
        "choice2": "เลี้ยง",
        "choice3": "เจ้า",
        "choice4": "เจ้าเตี้ย",
        "correct": "4",
        "Title": "ข้อใดคือคำนาม"
    },
    {
        "choice1": "หมู",
        "choice2": "เห่า",
        "choice3": "มดแดง",
        "choice4": "งูเหลือม",
        "correct": "2",
        "Title": "คำในข้อใดไม่ใช่คำนาม"
    },
    {
        "choice1": "ประพฤติ",
        "choice2": "นิยม",
        "choice3": "อยู่",
        "choice4": "หาง",
        "correct": "4",
        "Title": "คำในข้อใดไม่ใช่คำกริยา"
    },
    {
        "choice1": "ผ้าม่าน",
        "choice2": "รวยเงิน",
        "choice3": "เดินดู",
        "choice4": "ดาวเด่น",
        "correct": "2",
        "Title": "คำว่า <b>“สาวสวย”</b>คล้องจองกับคำใด"
    },
    {
        "choice1": "เขาเดินเร็วมาก",
        "choice2": "นิดและหน่อยกินก๋วยเตี๋ยว",
        "choice3": "ดินสอตกอยู่ใต้เก้าอี้",
        "choice4": "คุณพระช่วย! เสียชีวิตแล้วเหรอ?",
        "correct": "1",
        "Title": "ประโยคใดมีคำวิเศษณ์"
    },
    {
        "choice1": "คุณครูหวังดีกับเธอนะ",
        "choice2": "คุณพ่อและคุณแม่ไปตลาด",
        "choice3": "กุญแจบ้านอยู่ใต้พรมเช็ดเท้า",
        "choice4": "คุณยายไปดูละครที่โรงละครแห่งชาติ",
        "correct": "2",
        "Title": "ข้อใดไม่ได้ใช้คำบุพบท"
    },
    {
        "choice1": "ว้าย! โจรปล้น",
        "choice2": "อุ๊ย! เงินหล่น",
        "choice3": "เอ๊ะ! ทำไมถึงเป็นแบบนี้ไปได้",
        "choice4": "ว้าว! ไม่อยากจะเชื่อเลย",
        "correct": "4",
        "Title": "ข้อใดเป็นคำอุทานที่บอกความรู้สึกประหลาดใจ"
    },
    {
        "choice1": "ปลาจดรายชื่อเพื่อนๆ",
        "choice2": "มดคัดลอกนิทานที่ชอบ",
        "choice3": "เดี่ยวแต่งกลอนตามที่ตนเองชอบ",
        "choice4": "ฝ้ายเขียนย่อความนิทานที่อ่าน",
        "correct": "3",
        "Title": "ใครเขียนงานเชิงสร้างสรรค์"
    },
    {
        "choice1": "สเปะสปะ",
        "choice2": "สะนุกสะนาน",
        "choice3": "สะอึกสะอื้น",
        "choice4": "สะบักสบอม",
        "correct": "3",
        "Title": "ข้อใดเขียนถูกต้อง"
    },
    {
        "choice1": "กะลา",
        "choice2": "ตลิ่ง",
        "choice3": "พญา",
        "choice4": "โหรพา",
        "correct": "4",
        "Title": "ข้อใดเขียนผิด"
    },
    {
        "choice1": "ประโยคคำถาม",
        "choice2": "ประโยคคำสั่ง",
        "choice3": "ประโยคขอร้อง",
        "choice4": "ประโยคบอกเล่า",
        "correct": "4",
        "Title": "<b>“ฝนตกหนักมาก”</b>  เป็นประโยคประเภทใด"
    },
    {
        "choice1": "เพื่อเป็นการเตือนความจำ",
        "choice2": "เขียนเพื่อเก็บความรู้ไว้กับตัวเองเพียงคนเดียว",
        "choice3": "เพื่อฝึกทักษะทางด้านการเขียน",
        "choice4": "เพิ่มพูนวิธีการใช้คำในภาษาไทยให้ดียิ่งขึ้น",
        "correct": "2",
        "Title": "ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับการเขียนบันทึกความรู้"
    },
    {
        "choice1": "การไฟฟ้าส่วนภูมิภาค",
        "choice2": "การไฟฟ้าฝ่ายผลิตแห่งประเทศไทย",
        "choice3": "การไฟฟ้านครหลวง",
        "choice4": "การกีฬาแห่งประเทศไทย",
        "correct": "2",
        "Title": "กฟผ. เขียนเป็นคำเต็มว่าอย่างไร"
    },
    {
        "choice1": "ปษ.",
        "choice2": "ปณ.",
        "choice3": "ปษณ.",
        "choice4": "ป.ณี.",
        "correct": "2",
        "Title": "ไปรษณีย์ เขียนเป็นคำย่อได้คือข้อใด"
    },
    {
        "choice1": "สถานที่",
        "choice2": "พลับพลึง",
        "choice3": "กษัตริย์",
        "choice4": "กรรณิการ์",
        "correct": "2",
        "Title": "ข้อใดมีคำควบกล้ำ"
    },
    { 
        "choice1": "คลุมเครือ",
        "choice2": "ทรุดโทรม",
        "choice3": "โคจร",
        "choice4": "จริงจัง",
        "correct": "1",
        "Title": "ข้อใดอ่านออกเสียงเป็นคำควบกล้ำแท้"
    },
    { 
        "choice1": "มัดมือชก",
        "choice2": "มือเป็นระวิง",
        "choice3": "มือสะอาด",
        "choice4": "ชุบมือเปิบ",
        "correct": "4",
        "Title": "<b>“ฉันสร้างทุกอย่างมากับมือ แต่เขากลับ..........ไปง่ายๆ”</b> ควรเติมข้อใดลงในช่องว่าง"
    },
    { 
        "choice1": "ทำคุณบูชาโทษ",
        "choice2": "ทำบุญเอาหน้า",
        "choice3": "ทำนาบนหลังคน",
        "choice4": "ทำนาออมกล้า  ทำปลาออมเกลือ",
        "correct": "2",
        "Title": "<b>“แม่คนนี้ทำบุญเป็นล้าน ไม่รู้ว่า.....รึเปล่า”</b> ควรเติมข้อใดลงในช่องว่าง"
    },
    { 
        "choice1": "พาน – ทาน",
        "choice2": "การ – กาล",
        "choice3": "สิบ – ริบ",
        "choice4": "นาย – กาย",
        "correct": "2",
        "Title": "ข้อใดเป็นคำพ้องเสียง"
    },
    { 
        "choice1": "โคลง – โครง",
        "choice2": "โศลก – โศก",
        "choice3": "เศร้า – เส้า",
        "choice4": "คราว - คล่าว",
        "correct": "3",
        "Title": "ข้อใดเป็นคำพ้องเสียง"
    },
    { 
        "choice1": "ปวดเศียร – เกษียณ",
        "choice2": "กาฬโรค – เหตุการณ์",
        "choice3": "ลวดลาย – พังทลาย",
        "choice4": "เพลาล้อรถ – เพลาเย็น",
        "correct": "4",
        "Title": "ข้อใดเป็นคำพ้องรูป"
    },
];

var questions4 = [{
        "choice1": "เจตภูต / ตุ๊กตา",
        "choice2": "ชาติพันธุ์ / ทานบดี",
        "choice3": "ขัดสมาธิ / จิตวิทยา",
        "choice4": "จิตเวช / นพศูล",
        "correct": "3",
        "Title": "ข้อใดมีคำที่สะกดด้วยแม่กดทุกคำ"
    },
    {
        "choice1": "นักษัตร",
        "choice2": "ธนบัตร",
        "choice3": "ไปรษณีย์",
        "choice4": "พรรณนา",
        "correct": "4",
        "Title": "ข้อใดมีคำที่อ่านออกเสียงตัวสะกดเหมือนในคำว่า เจริญ"
    },
    {
        "choice1": "พยศ",
        "choice2": "อากาศ",
        "choice3": "บ่วงบาศ",
        "choice4": "ประพาศ",
        "correct": "4",
        "Title": "คำในข้อใด เขียนไม่ถูกต้อง"
    },
    {
        "choice1": "โบราณกาล อ่านว่า โบ-ราน-นะ-กาน",
        "choice2": "ปรมินทร์ อ่านว่า ปอ-ระ-มิน",
        "choice3": "สารพัน อ่านว่า สา-ระ-พัน",
        "choice4": "ปริญญา อ่านว่า ปริน-ยา",
        "correct": "4",
        "Title": "คำในข้อใด อ่านไม่ถูกต้อง"
    },
    {
        "choice1": "ผ่ายผอม / ข้าวสาร",
        "choice2": "สูงส่ง / ไก่โต้ง",
        "choice3": "เรือยาว / ลิงลม",
        "choice4": "หีบเหล็ก / อุดตัน",
        "correct": "1",
        "Title": "คำในข้อใด มีพยัญชนะต้นเป็นอักษรสูงทั้งหมด"
    },
    {
        "choice1": "ศาลา / พักร้อน",
        "choice2": "ยักษ์ใหญ่ / มัวเมา",
        "choice3": "ตรวจตรา / จำปา",
        "choice4": "เร็วรี่ / ปรีดา",
        "correct": "3",
        "Title": "คำในข้อใด มีพยัญชนะต้นเป็นอักษรกลางทั้งหมด"
    },
    {
        "choice1": "ราวี / สีสัน",
        "choice2": "คลุกเคล้า / พาที",
        "choice3": "บรรจบ / พบพาน",
        "choice4": "นานวัน / ขันแข็ง",
        "correct": "2",
        "Title": "คำในข้อใด มีพยัญชนะต้นเป็นอักษรต่ำทั้งหมด"
    },
    {
        "choice1": "หน่อยชมการแสดงรำพร้อมๆ กับกินข้าวโพดคั่ว",
        "choice2": "นิ่มทำเฉยๆ เมื่อตนเองพูดผิดพลาด",
        "choice3": "นิดฟังเพื่อนเล่าข่าวด้วยความตั้งใจ",
        "choice4": "น้อยโห่เมื่อได้ฟังเรื่องที่ตนเองไม่ชอบ",
        "correct": "3",
        "Title": "ใครปฏิบัติตนเป็นผู้ที่มีมารยาทในการฟัง การพูด และการดูมากที่สุด"
    },
    {
        "choice1": "ธันวาคม",
        "choice2": "มีนาคม",
        "choice3": "เมษายน",
        "choice4": "พฤษภาคม",
        "correct": "1",
        "Title": "คำในข้อใดประสมกับหันอากาศ และ ลากข้าง"
    },
    {
        "choice1": "ฤๅษี",
        "choice2": "ฤทัย",
        "choice3": "เกเร",
        "choice4": "มือขวา",
        "correct": "2",
        "Title": "คำในข้อใด มีเสียงสระประเภทเดียวกับคำว่า เลอะเทอะ"
    },
    {
        "choice1": "กลอนสี่",
        "choice2": "กลอนหก",
        "choice3": "กลอนแปด",
        "choice4": "กลอนสุภาพ",
        "correct": "2",
        "Title": "<b>“ถ้าฉันนั้นเป็นม้าลาย มาดหมายท่องไปทุกหน วิ่งเหยาะเยื้องย่างแยบยล สุขล้นทุกข์ใจไม่มี”</b> บทร้อยกรองข้างต้น เป็นคำประพันธ์ชนิดใด"
    },
    {
        "choice1": "ศัพย์",
        "choice2": "เจดีย์",
        "choice3": "อัศจรรย์",
        "choice4": "อนุสาวรีย์",
        "correct": "1",
        "Title": "คำในข้อใดใช้ตัวการันต์ไม่ถูกต้อง"
    },
    {
        "choice1": "ราชสีห์",
        "choice2": "อนันท์",
        "choice3": "บรรดาศักดิ์",
        "choice4": "เดียดฉันท์",
        "correct": "2",
        "Title": "คำในข้อใดใช้ตัวการันต์ไม่ถูกต้อง"
    },
    {
        "choice1": "ศาสตร์  อ่านว่า  สาด-ตะ",
        "choice2": "วิทย์  อ่านว่า  วิด",
        "choice3": "โจทก์   อ่านว่า  โจด",
        "choice4": "กษัตริย์ อ่านว่า กะ-สัด",
        "correct": "1",
        "Title": "คำในข้อใดอ่านไม่ถูกต้อง"
    },
    {
        "choice1": "เขียนบันทึกรายรับ - รายจ่าย",
        "choice2": "เขียนบันทึกเหตุการณ์ประจำวัน",
        "choice3": "เขียนรายงาน",
        "choice4": "เขียนจดหมายส่วนตัว",
        "correct": "2",
        "Title": "หากหนูน้อยต้องการทราบว่า เมื่อวานเธอทำอะไรไปบ้าง หนูน้อยควรเลือกเขียนอะไรจึงจะเหมาะสมที่สุด"
    },
    {
        "choice1": "พี่เตะฟุตบอล",
        "choice2": "แมวดำกินปลา",
        "choice3": "ป้าพายเรือ",
        "choice4": "ฝนตกหนักมาก",
        "correct": "4",
        "Title": "ประโยคในข้อใดไม่มีกรรม"
    },
    {
        "choice1": "เลือดออกมาก",
        "choice2": "เด็กชายต้อม",
        "choice3": "นำไปส่งโรงพยาบาล",
        "choice4": "ทำแผลเรียบร้อยแล้ว",
        "correct": "2",
        "Title": "กลุ่มคำ <b>“หกล้มศีรษะแตก”</b> ควรเติมข้อความใด จึงจะเป็นประโยค"
    },
    {
        "choice1": "เรอ",
        "choice2": "รึ",
        "choice3": "ริ",
        "choice4": "รือ",
        "correct": "3",
        "Title": "ตัว ฤ ของ คำว่า กฤษณา อ่านออกเสียงอย่างไร"
    },
    {
        "choice1": "คฤหัสถ์",
        "choice2": "หฤทัย",
        "choice3": "อังกฤษ",
        "choice4": "นฤมลทิน",
        "correct": "3",
        "Title": "ข้อใดอ่านออกเสียง ตัว ฤ ไม่เหมือนกับคำว่านฤมิต"
    },
    {
        "choice1": "ผม",
        "choice2": "หนู",
        "choice3": "ดิฉัน",
        "choice4": "ฉัน",
        "correct": "1",
        "Title": "<b>“_____ ชื่อสมชายครับ”</b> ควรเติมคำสรรพนามใด"
    },
    {
        "choice1": "เขาไม่รู้จักเธอหรอก",
        "choice2": "มันมีสีเหลือง",
        "choice3": "ฉันชอบกินหัวมัน",
        "choice4": "คุณไปกับเขาดีกว่า",
        "correct": "3",
        "Title": "ข้อใดมีคำสรรพนามชนิดเดียวกับ <b>“ข้าพเจ้า”</b>"
    },
    {
        "choice1": "อนุรักษ์",
        "choice2": "ปรับปรุง",
        "choice3": "ปฏิรูป",
        "choice4": "ปฏิบัติ",
        "correct": "1",
        "Title": "<b>“เราควรช่วยกัน ______ วัฒนธรรมไทย”</b> ควรเติมคำกริยาใด"
    },
    {
        "choice1": "พี่",
        "choice2": "น้อง",
        "choice3": "ฉัน",
        "choice4": "ลูก",
        "correct": "3",
        "Title": "<u>“บ้านข้อยอยู่ จ. ขอนแก่น”</u> คำที่ขีดเส้นใต้หมายความว่าอย่างไร"
    },
    {
        "choice1": "ขวาน",
        "choice2": "นายพราน",
        "choice3": "อันตราย",
        "choice4": "กำหนด",
        "correct": "4",
        "Title": "คำในข้อใดใช้อักษรนำ"
    },
    {
        "choice1": "พิโรธ อ่านว่า  พิ - โรด",
        "choice2": "สรุป อ่านว่า  สะ - หรุบ",
        "choice3": "ผลิตผล อ่านว่า  ผลิต - ผน",
        "choice4": "บรรดา อ่านว่า บัน - ดา",
        "correct": "3",
        "Title": "คำในข้อใด อ่านไม่ถูกต้อง"
    },
    {
        "choice1": "ผี",
        "choice2": "สำลี",
        "choice3": "ไก่ต้ม",
        "choice4": "ไข่ต้ม",
        "correct": "3",
        "Title": "เลือกคำที่กำหนดให้เติมลงในช่องว่างให้ได้ใจความที่สมบูรณ์  <b>หน้าซีดเป็น_______________</b>"
    },
    {
        "choice1": "ตี",
        "choice2": "ด่า",
        "choice3": "ว่า",
        "choice4": "สอน",
        "correct": "1",
        "Title": "เลือกคำที่กำหนดให้เติมลงในช่องว่างให้ได้ใจความที่สมบูรณ์ <b>รักวัวให้ผูก รักลูกให้_____________</b>"
    },
    {
        "choice1": "ทรวดทรง",
        "choice2": "ครองแครง",
        "choice3": "สร้างบ้าน",
        "choice4": "ต้นไทย",
        "correct": "2",
        "Title": "คำในข้อใดเป็นคำควบกล้ำแท้"
    },
    {
        "choice1": "ทรัพย์สิน",
        "choice2": "ปลงตก",
        "choice3": "ปลุกระดม",
        "choice4": "อร่อยจัง",
        "correct": "1",
        "Title": "คำในข้อใด เป็นคำควบกล้ำไม่แท้"
    },
    {
        "choice1": "ศัตรู อ่านว่า  สัด - ตู",
        "choice2": "ตลอด อ่านว่า  ตะ - หลอด",
        "choice3": "ปลาบปลื้ม  อ่านว่า ปลาบ - ปลื้ม",
        "choice4": "จิตใจ อ่านว่า  จิด - ไจ",
        "correct": "1",
        "Title": "คำในข้อใด อ่านไม่ถูกต้อง"
    },
    {
        "choice1": "พระกลด",
        "choice2": "พระจันทร์",
        "choice3": "พระธรรม",
        "choice4": "พระเอก",
        "correct": "1",
        "Title": "ข้อใดเป็นคำราชาศัพท์"
    },
    {
        "choice1": "แจก",
        "choice2": "ให้แก่",
        "choice3": "ถวาย",
        "choice4": "มอบ",
        "correct": "3",
        "Title": "<b>“นักเรียนนำของไป_______พระภิกษุ”</b> ควรเติมคำใด"
    },
    {
        "choice1": "ห้องสมุด",
        "choice2": "พิพิธภัณฑ์",
        "choice3": "ป้ายโฆษณา",
        "choice4": "ผู้ที่เกี่ยวข้อง",
        "correct": "3",
        "Title": "ข้อใดไม่ใช่แหล่งข้อมูลในการเขียนชีวประวัติ"
    },
    {
        "choice1": "ค์",
        "choice2": "ศ์",
        "choice3": "ร์",
        "choice4": "ย์",
        "correct": "1",
        "Title": "<b>ไตรยาง__</b> เลือกตัวการันต์เติมในคำที่กำหนดให้ ให้ถูกต้อง"
    },
    {
        "choice1": "สรง / สงฆ์",
        "choice2": "สง / สงฆ์",
        "choice3": "สงฆ์ / สง",
        "choice4": "สงฆ์ / สรง",
        "correct": "4",
        "Title": "<b>พระ___   ___ น้ำในเวลาเย็น</b> ควรเติมคำข้อใด"
    },
    {
        "choice1": "มาน / มาน",
        "choice2": "มาร / มาล",
        "choice3": "มาน / มาร",
        "choice4": "มาล / มาร",
        "correct": "1",
        "Title": "<b>เข้ารู้สึกทร___ เพราะเป็นโรคท้อง ___ </b>ควรเติมคำข้อใด"
    },
    {
        "choice1": "ปรัศนี",
        "choice2": "นขลิขิต",
        "choice3": "บุพสัญญา",
        "choice4": "อัญประกาศ",
        "correct": "4",
        "Title": "เครื่องหมาย  “__” เรียกว่าอะไร"
    },
    {
        "choice1": "ฝนตกทุกทุกวัน",
        "choice2": "ฝนตกทุกวันวัน",
        "choice3": "ฝนตกทุกวันทุกวัน",
        "choice4": "ฝนตกทุกวัน ฝนตกทุกวัน",
        "correct": "3",
        "Title": "<b>“ฝนตกทุกวันๆ”</b> อ่านว่าอย่างไร"
    },
    {
        "choice1": "ผุดผ่อง   ผุดผาด   ผุดลุกผุดนั่ง",
        "choice2": "พิจิต   พิจิก   พิจิตร   พิฆาต",
        "choice3": "พายัพ   พายุ   พารา   พาลี",
        "choice4": "มหาชาติ  มหาเทพ  มหาชน  มหาธาตุง",
        "correct": "1",
        "Title": "ข้อใดเรียงลำดับคำตามพจนานุกรมได้ถูกต้อง"
    },
    {
        "choice1": "ขี้เถ้า",
        "choice2": "ขัดสมาส",
        "choice3": "เข็ญใจ",
        "choice4": "ขาดดุล",
        "correct": "2",
        "Title": "คำในข้อใดเขียนไม่ถูกต้อง"
    },
    {
        "choice1": "ฑูต",
        "choice2": "ทูนหัว",
        "choice3": "เทิด",
        "choice4": "แท็กซี่",
        "correct": "1",
        "Title": "คำในข้อใดเขียนไม่ถูกต้อง"
    },
    {
        "choice1": "ดอกไม้ ชูช่อ ล่อแมลง",
        "choice2": "มดแดง ตัวนิด ฤทธิ์มาก",
        "choice3": "ตากลม ชมดาว หนาวเหน็บ",
        "choice4": "นักเรียน เพียรหมั่น เขียนอ่าน",
        "correct": "3",
        "Title": "ข้อใดมีคำคล้องจองกันทุกคำ"
    },
    {
        "choice1": "มนุษย์",
        "choice2": "คน",
        "choice3": "สัตว์",
        "choice4": "ใคร",
        "correct": "1",
        "Title": "<b>แล้วสอนว่าอย่าไว้ใจ___________มันแสนสุดลึกล้ำเหลือกำหนด</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "พูด",
        "choice2": "ไปพูด",
        "choice3": "ตะคั้น",
        "choice4": "กระนั้น",
        "correct": "3",
        "Title": "<b>จะพูดจาปราศรัยกับใครนั้น อย่า_________ตะคอกให้เคืองหู</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "ม้า",
        "choice2": "จระเข้",
        "choice3": "ช้าง",
        "choice4": "เสือ",
        "correct": "4",
        "Title": "<b>เราก็ชายหมายมาดว่าชาติเชื้อ ถึงปะ_____ จะสู้ดูสักหน</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "พระนคร",
        "choice2": "พระราชวัง",
        "choice3": "เมือง",
        "choice4": "ปราสาท",
        "correct": "3",
        "Title": "<b>โยคีครูผู้เฒ่าจึงเล่าเรื่อง นี่คือ________ ท้าวปักกาภาษาไสย</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "สะบัด",
        "choice2": "กระแทก",
        "choice3": "สังหาร",
        "choice4": "ตลบ",
        "correct": "1",
        "Title": "<b>ม้ามังกรถอนถีบกีบ__________เอาหางรัดราวกับนาคทั้งปากขบ</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "แกลบ",
        "choice2": "หิน",
        "choice3": "ทราย",
        "choice4": "น้ำ",
        "correct": "4",
        "Title": "<b>การนินทากาเลเหมือนเท__________ไม่ชอกช้ำเหมือนเอามีดมากรีดหิน</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "พ่อ",
        "choice2": "แพ้",
        "choice3": "ปู่",
        "choice4": "แม่",
        "correct": "4",
        "Title": "<b>ฤๅษีสุดสาครรับพร___________จะห่างแหหวงจิตคิดสงสาร</b> ควรเติมคำในข้อใด"
    },
    {
        "choice1": "อาบ",
        "choice2": "กราบ",
        "choice3": "ทราบ",
        "choice4": "ภาพ",
        "correct": "1",
        "Title": "<b>กุมารสุดสาครยอกรกราบน้ำตา________อุตส่าห์ฝืนสะอื้นไห้</b> ควรเติมคำในข้อใด"
    },
];

var questions5 = [{
        "choice1": "1 ชนิด",
        "choice2": "2 ชนิด",
        "choice3": "3 ชนิด",
        "choice4": "4 ชนิด",
        "correct": "3",
        "Title": "<b>''ต๊ายตาย! ไม่รู้จริงๆ ว่าแม่เธอมา''</b> ข้อความนี้มีเครื่องหมายวรรคตอนกี่ชนิด"
    },
    {
        "choice1": "นิยาย",
        "choice2": "นวนิยาย",
        "choice3": "เรื่องสั้น",
        "choice4": "นิทาน",
        "correct": "3",
        "Title": "บันเทิงคดีชนิดใดที่เขียนยากที่สุด"
    },
    {
        "choice1": "ผู้เล่าเป็นตัวละครเอกเอง",
        "choice2": "ผู้แต่งเป็นตัวละครเอกเอง",
        "choice3": "สมมติตนเป็นตัวละครนั้น",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "เรื่องสั้นจะมีการดำเนินเรื่องอย่างไร"
    },
    {
        "choice1": "1 โครง",
        "choice2": "2 โครง",
        "choice3": "3 โครง",
        "choice4": "กี่โครงเรื่องก็ได้",
        "correct": "1",
        "Title": "เรื่องสั้นจะมีโครงเรื่องกี่โครง"
    },
    {
        "choice1": "ไทย",
        "choice2": "พม่า",
        "choice3": "มอญ",
        "choice4": "เขมร",
        "correct": "3",
        "Title": "เรื่องราชาธิราช เป็นพงศาวดารของชาติใด"
    },
    {
        "choice1": "กษัตริย์ที่เป็นใหญ่",
        "choice2": "กษัตริย์ทางตะวันตก",
        "choice3": "กษัตริย์ทางตะวันออก",
        "choice4": "กษัตริย์ของมอญ",
        "correct": "1",
        "Title": "<b>''ราชาธิราช''</b> แปลว่า"
    },
    {
        "choice1": "คล้อยตาม",
        "choice2": "ขัดแย้ง",
        "choice3": "เลือกเอาอย่างใดอย่างหนึ่ง",
        "choice4": "เหตุผล",
        "correct": "2",
        "Title": "<b>''คนจนแต่มีน้ำใจ''</b> ข้อความที่กำหนดให้เป็นประโยคชนิดใด"
    },
    {
        "choice1": "ประโยคคล้อยตาม",
        "choice2": "ประโยคขัดแย้ง",
        "choice3": "ประโยคเลือกเอา",
        "choice4": "ประโยคเหตุผล",
        "correct": "4",
        "Title": "<b>''เขาไม่เข้าใจจึงทำการบ้านไม่ได้''</b> เป็นประโยคความรวมชนิดใด"
    },
    {
        "choice1": "คล้อยตาม",
        "choice2": "ขัดแย้ง",
        "choice3": "เลือกเอา",
        "choice4": "เหตุผล",
        "correct": "4",
        "Title": "<b>''บุคคลผู้เสียสละย่อมได้รับการยกย่อง''</b> ประโยคที่กำหนดให้เป็นประโยคชนิดใด"
    },
    {
        "choice1": "คล้อยตาม",
        "choice2": "ขัดแย้ง",
        "choice3": "เลือกเอา",
        "choice4": "เหตุผล",
        "correct": "3",
        "Title": "<b>''เธอจะเอาสร้อยหรือแหวนที่แม่ให้''</b> ข้อความที่กำหนดให้เป็นประโยคชนิดใด"
    },
    {
        "choice1": "คำพังเพย",
        "choice2": "สำนวน",
        "choice3": "สุภาษิต",
        "choice4": "คำคม",
        "correct": "3",
        "Title": "<b>''ตนเป็นที่พึ่งแห่งตน''</b> กลุ่มคำนี้น่าจะอยู่ในหัวข้อใด"
    },
    {
        "choice1": "28 คำ",
        "choice2": "29 คำ",
        "choice3": "30 คำ",
        "choice4": "32 คำ",
        "correct": "4",
        "Title": "กลอนแปด 1 บท มีกี่คำ"
    },
    {
        "choice1": "คำที่ดีมีคติสอนใจไปในทางพุทธศาสนา",
        "choice2": "เป็นคำที่ไม่ส่อไปทางเสื่อมเสีย",
        "choice3": "เป็นคำที่ไม่มุ่งทำลาย ชาติ ศาสนา และสถาบัน",
        "choice4": "ถูกทั้ง ก, ข และ ค",
        "correct": "4",
        "Title": "สุภาษิต หมายถึงอะไร"
    },
    {
        "choice1": "เมื่อทำผิดคนอื่นไม่เห็นความผิดแห่งตน แต่ตนเองนั้นรู้ตลอดเวลา",
        "choice2": "เมื่อคนทำผิดแล้วใครมาพูดกระทบถึงก็เอะอะโวยวาย",
        "choice3": "รู้ทั้งรู้แต่แกล้งทำเป็นไม่รู้",
        "choice4": "เข้าตาจนคิดอะไรไม่ออก",
        "correct": "2",
        "Title": "ข้อใดตรงกับสำนวนที่ว่า <b>''กินปูนร้อนท้อง''</b>"
    },
    {
        "choice1": "ชี้โพรงให้กระรอก",
        "choice2": "สอนจระเข้ให้ว่ายน้ำ",
        "choice3": "ลิงได้แก้ว",
        "choice4": "สอนหนังสือสังฆราช",
        "correct": "4",
        "Title": "<b>''แนะนำสิ่งที่เขากำลังทำอยู่''</b> ตรงกับสำนวนในข้อใด"
    },
    {
        "choice1": "กินปูนร้อนท้อง",
        "choice2": "กินอยู่กับปากอยากอยู่กับท้อง",
        "choice3": "หอกข้างแคร่",
        "choice4": "น้ำนิ่งไหลลึก",
        "correct": "3",
        "Title": "<b>''อันตรายอยู่ใกล้ตนเองมาก''</b> ตรงกับสำนวนใด"
    },
    {
        "choice1": "แก่",
        "choice2": "กับ",
        "choice3": "ต่อ",
        "choice4": "ถูกทุกข้อ",
        "correct": "1",
        "Title": "<b>''การสูบบุหรี่ให้โทษ..........ร่างกาย''</b> เติมคำบุพบทข้อใด"
    },
    {
        "choice1": "ใน, ของ",
        "choice2": "ของ, สำหรับ",
        "choice3": "ของ, ต่อ",
        "choice4": "ใน, กับ",
        "correct": "3",
        "Title": "<b>''อวัยวะบางส่วน...........ของร่างกายมีประโยชน์..........ผู้อื่น''</b> เติมคำบุพบทข้อใดถูกต้องที่สุด"
    },
    {
        "choice1": "28 คำ",
        "choice2": "30 คำ",
        "choice3": "32 คำ",
        "choice4": "34 คำ",
        "correct": "2",
        "Title": "โคลงสี่สุภาพ 1 บท มีจำนวนคำเท่าไร"
    },
    {
        "choice1": "เอก 4 โท 3",
        "choice2": "เอก 3 โท 4",
        "choice3": "เอก 7 โท 4",
        "choice4": "เอก 4 โท 7",
        "correct": "3",
        "Title": "โคลงสี่สุภาพ 1 บท มีบังคับเอกโทจำนวนเท่าใด"
    },
    {
        "choice1": "บาทที่ 1",
        "choice2": "บาทที่ 2",
        "choice3": "บาทที่ 3, 4",
        "choice4": "บาทที่ 1, 3",
        "correct": "4",
        "Title": "คำสร้อยจะอยู่ในบาทที่เท่าไรของโคลง"
    },
    {
        "choice1": "บาทที่ 1",
        "choice2": "บาทที่ 2",
        "choice3": "บาทที่ 3",
        "choice4": "บาทที่ 4",
        "correct": "4",
        "Title": "จำนวนคำของโคลงบาทที่เท่าไรต่างจากพวก"
    },
    {
        "choice1": "แม่นกกาเหว่า",
        "choice2": "แม่นาคพระโขนง",
        "choice3": "แม่พิมพ์ของชาติ",
        "choice4": "แมวเหมียวเอย",
        "correct": "1",
        "Title": "ข้อใดเป็นเพลงกล่อมเด็ก"
    },
    {
        "choice1": "บ่ายโมงตรง",
        "choice2": "เข้าสู่ตอนเย็น",
        "choice3": "เข้าสู่ภาคค่ำ",
        "choice4": "บ่ายมากแล้วเกือบมืด",
        "correct": "4",
        "Title": "<b>''เวลาบ่ายคล้อย''</b> เป็นเวลาใด"
    },
    {
        "choice1": "ขุนช้างขุนแผน",
        "choice2": "สามก๊ก",
        "choice3": "รามเกียรติ์",
        "choice4": "อิเหนา",
        "correct": "1",
        "Title": "คำประพันธ์เรื่องใดจะกล่าวถึงบ้านเรือนไทย"
    },
    {
        "choice1": "จั่ว",
        "choice2": "พรึง",
        "choice3": "แปลาน",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "ข้อใดเป็นส่วนประกอบของบ้านทรงไทย"
    },
    {
        "choice1": "รักผมกว่าเหา",
        "choice2": "รักห่างกว่าชิด",
        "choice3": "รักดีหามจั่ว รักชั่วหามเสา",
        "choice4": "รักถ้ำมากกว่าเรือน",
        "correct": "3",
        "Title": "เมื่อพูดถึงจั่ว ผู้อ่านมักนึกถึงสุภาษิตในข้อใด"
    },
    {
        "choice1": "10 คำ หรือ 10 พยางค์",
        "choice2": "22 คำ หรือ 22 พยางค์",
        "choice3": "12 คำ หรือ 12 พยางค์",
        "choice4": "13 คำ หรือ 13 พยางค์",
        "correct": "2",
        "Title": "กาพย์ยานี 11 หนึ่งบท มีกี่คำกี่พยางค์"
    },
    {
        "choice1": "1 บาท",
        "choice2": "2 บาท",
        "choice3": "3 บาท",
        "choice4": "4 บาท",
        "correct": "2",
        "Title": "กาพย์ยานี 11 หนึ่งบท มีกี่บาท"
    },
    {
        "choice1": "2 วรรค",
        "choice2": "4 วรรค",
        "choice3": "5 วรรค",
        "choice4": "8 วรรค",
        "correct": "1",
        "Title": "กาพย์ยานี 11 หนึ่งบาทมีกี่วรรค"
    },
    {
        "choice1": "สำเร็จในชีวิต",
        "choice2": "ไปสู่จุดหมายปลายทาง",
        "choice3": "อนาคตรุ่งโรจน์",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "เมื่อมนุษย์มีความเพียร ความอดทน ความกล้าหาญ มนุษย์ผู้นั้นจะเป็นคนในข้อใด"
    },
    {
        "choice1": "?",
        "choice2": "-",
        "choice3": "!",
        "choice4": "@",
        "correct": "3",
        "Title": "คำอุทานจะใช้เครื่องหมายใดกำกับ"
    },
    {
        "choice1": "กำลังโกรธ",
        "choice2": "กำลังน้อยใจ",
        "choice3": "กำลังประชด",
        "choice4": "กำลังใจดี",
        "correct": "2",
        "Title": "<b>''เออ! เอาไปเถอะ ฉันไม่ต้องการแล้ว''</b> คำอุทานแสดงอารมณ์ข้อนี้เป็นอารมณ์ใด"
    },
    {
        "choice1": "คำกิริยา",
        "choice2": "คำวิเศษณ์",
        "choice3": "คำบุพบท",
        "choice4": "คำอุทาน",
        "correct": "4",
        "Title": "<b>''ไม่ซงไม่ใส่มันแล้ว มันร้อน''</b> ข้อความนี้มีคำชนิดใด"
    },
    {
        "choice1": "จดหมายถึงเพื่อน",
        "choice2": "จดหมายถึงพระสงฆ์",
        "choice3": "จดหมายถึงครูและญาติผู้ใหญ่",
        "choice4": "ถูกทุกข้อ",
        "correct": "1",
        "Title": "จดหมายชนิดใดเป็นจดหมายส่วนตัว"
    },
    {
        "choice1": "พื้นที่ที่สำคัญทางประวัติศาสตร์",
        "choice2": "พื้นที่ที่สงวนรักษาไว้",
        "choice3": "พื้นที่เพื่อประโยชน์ในการศึกษาทางประวัติศาสตร์",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "คำว่า <b>''อุทยาน''</b> หมายถึงอะไร"
    },
    {
        "choice1": "เกิดความสูญเสีย",
        "choice2": "เกิดความพลัดพราก",
        "choice3": "เกิดความทุกข์",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "ทุกคนไม่ชอบสงคราม เพราะสงครามทำให้เกิดอะไร"
    },
    {
        "choice1": "ไม่ข่มเหงใคร",
        "choice2": "ไม่รังแกใครก่อน แต่เมื่อถูกรังแกก็พร้อมที่จะป้องกัน",
        "choice3": "เคารพสิทธิของกันและกัน",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "<b>''ไทยนี้รักสงบแต่ถึงรบไม่ขลาด''</b> ข้อความนี้กล่าวถึงลักษณะของคนไทยอย่างไร"
    },
    {
        "choice1": "ไทยนี้รักสงบแต่ถึงรบไม่ขลาด",
        "choice2": "เอกราชจะไม่ให้ใครข่มขี่",
        "choice3": "สละเลือดทุกหยาดเป็นชาติพลี",
        "choice4": "เถลิงประเทศชาติไทยทวีมีชัย ชโย",
        "correct": "3",
        "Title": "บรรพบุรุษของไทยป้องกันประเทศชาติด้วยวิธีใด"
    },
    {
        "choice1": "หลวงสารานุประพันธ์",
        "choice2": "นวล ปาจิณพยัคฆ์",
        "choice3": "พระเจนดุริยางค์",
        "choice4": "ถูกทั้ง ก และ ข",
        "correct": "4",
        "Title": "ผู้ประพันธ์เนื้อร้องเพลงชาติไทยคือผู้ใด"
    },
    {
        "choice1": "บอกหน้าที่ของคำว่าเป็นคำนาม",
        "choice2": "บอกที่มาของคำ",
        "choice3": "บอกความหมายของคำ",
        "choice4": "บอกคำอ่าน",
        "correct": "3",
        "Title": "คำว่า <b>''ม้า น.'' (น.)</b> หมายถึงอะไร"
    },
    {
        "choice1": "ภาษาบาลี",
        "choice2": "ภาษาสันสกฤต",
        "choice3": "ภาษาไทย",
        "choice4": "ภาษาญวน",
        "correct": "2",
        "Title": "<b>''ศึกษา (ส.)''</b> แสดงว่าคำนี้มาจากภาษาใด"
    },
    {
        "choice1": "ทลาย",
        "choice2": "ทะลาย",
        "choice3": "พวง",
        "choice4": "กำ",
        "correct": "2",
        "Title": "<b>''มะพร้าว...............นั้นเป็นมะพร้าวน้ำหอม''</b> ควรเติมคำลงในช่องว่างจึงเหมาะสม"
    },
    {
        "choice1": "พวง",
        "choice2": "เครือ",
        "choice3": "ทะลาย",
        "choice4": "ทลาย",
        "correct": "2",
        "Title": "<b>''กล้วยหอม..............นี้มี 10 หวี''</b> ควรเติมคำใดลงในช่องว่างจึงเหมาะสม"
    },
    {
        "choice1": "14 คำ",
        "choice2": "16 คำ",
        "choice3": "18 คำ",
        "choice4": "28 คำ",
        "correct": "2",
        "Title": "กาพย์สุรางคนางค์ 1 บท มีจำนวนคำและพยางค์เท่าไร"
    },
    {
        "choice1": "สุริยัน",
        "choice2": "สุริโย",
        "choice3": "สุริยะ",
        "choice4": "ถูกทุกข้อ",
        "correct": "3",
        "Title": "คำไวพจน์ของคำว่า ''ตะวัน'' คือคำตอบในข้อใด"
    },
    {
        "choice1": "ภาคกลาง",
        "choice2": "ภาคเหนือ",
        "choice3": "ภาคใต้",
        "choice4": "ภาคอีสาน",
        "correct": "1",
        "Title": "เพลงเกี่ยวข้าวเป็นเพลงในภาคใดของประเทศไทย"
    },
    {
        "choice1": "2 วรรค",
        "choice2": "3 วรรค",
        "choice3": "4 วรรค",
        "choice4": "5 วรรค",
        "correct": "2",
        "Title": "กาพย์ฉบัง 16 หนึ่งบท มีกี่วรรค"
    },
    {
        "choice1": "ต่างกันที่ใช้คำบังคับในวรรค",
        "choice2": "ต่างกันที่ใช้คำบังคับในบาท",
        "choice3": "ต่างกันที่ใช้คำบังคับในบท",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "กาพย์สุรางคนางค์ 28 ต่างจากกาพย์ยานี 11 และกาพย์ฉบัง 16 อย่างไร"
    },
    {
        "choice1": "กาพย์ยานี 11",
        "choice2": "กาพย์ฉบัง 16",
        "choice3": "กาพย์สุรางคนางค์ 28",
        "choice4": "ถูกทุกข้อ",
        "correct": "3",
        "Title": "กาพย์ชนิดใดใช้คำในบท 28 คำ ยืดหยุ่นคำไม่ได้"
    },
];

var questions6 = [{
        "choice1": "พืชกินคน",
        "choice2": "พืชกินโคลน",
        "choice3": "พืชกินสัตว์",
        "choice4": "พืชกินเป็ด",
        "correct": "3",
        "Title": "ต้นหม้อข้าวหม้อแกงลิง มีชื่ออีกอย่างหนึ่งว่าอะไร"
    },
    {
        "choice1": "สร้างสรร",
        "choice2": "สร้างสัน",
        "choice3": "สร้างสรรค์",
        "choice4": "สร้างสันต์",
        "correct": "3",
        "Title": "<b>''นักเรียนทุกคนมีความคิด..............เพื่อสร้างผลงานของตน''</b> เติมคำในข้อใดถูกต้องที่สุด"
    },
    {
        "choice1": "พรรนณา",
        "choice2": "พรรณนา",
        "choice3": "พันณา",
        "choice4": "พัลณา",
        "correct": "2",
        "Title": "<b>''นักเรียนลองเขียน...............ถึงธรรมชาติว่ามีความงามแค่ไหน''</b> เติมคำในข้อใดถูกต้องที่สุด"
    },
    {
        "choice1": "บันยาย",
        "choice2": "บันรยาย",
        "choice3": "บรรยาย",
        "choice4": "บัน-ระ-ยาย",
        "correct": "3",
        "Title": "<b>''นักเรียนมาฟัง................เรื่องการสอบเข้าเรียนต่อมหาวิทยาลัย''</b> เติมคำในข้อใดถูกต้องที่สุด"
    },
    {
        "choice1": "บรรณารักษ์",
        "choice2": "บรรนารักษ์",
        "choice3": "บรรณรักษ์",
        "choice4": "บรรนรักษ์",
        "correct": "1",
        "Title": "ผู้ที่ดูแลแนะนำการใช้ห้องสมุดคือผู้ใด"
    },
    {
        "choice1": "สวรรค์คต",
        "choice2": "สวรรคต",
        "choice3": "สวรรณคต",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "2",
        "Title": "<b>''..................แปลว่า ตาย''</b> เติมคำใดลงในช่องว่างจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "จันยา",
        "choice2": "จรรญา",
        "choice3": "จรรยา",
        "choice4": "จันทร์ยา",
        "correct": "3",
        "Title": "<b>''ครูทุกคนต้องมี...............บรรณในการสอน''</b> เติมคำใดในช่องว่างจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "บรรจบ",
        "choice2": "บรรจวบ",
        "choice3": "บรรจด",
        "choice4": "ถูกทุกข้อ",
        "correct": "1",
        "Title": "<b>''แม่น้ำสามสายได้มา..............กันที่สองแคว''</b> เติมคำใดลงในช่องว่างจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "บันทึก",
        "choice2": "บันทึง",
        "choice3": "บันลือ",
        "choice4": "บันเทิง",
        "correct": "2",
        "Title": "<b>''แม่...........ถึงความหลังเพราะโหยหาพ่อ''</b> เติมคำใดลงในช่องว่างจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "สันหา",
        "choice2": "สันต์หา",
        "choice3": "สรรค์หา",
        "choice4": "สรรหา",
        "correct": "4",
        "Title": "<b>''ครูพยายาม...............วิชาการใหม่ๆ มาให้ลูกศิษย์''</b> เติมคำในข้อใดจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "ขยะที่ลอยมาตามน้ำ",
        "choice2": "พืชน้ำที่ขึ้นอยู่ในน้ำและมีเศษซากไม้ต่างๆ",
        "choice3": "เศษถุงพลาสติก หญ้าต่างๆ ในน้ำ",
        "choice4": "ไม่มีข้อใดถูก",
        "correct": "2",
        "Title": "ข้อใดตรงกับความหมายของ <b>''กอสวะ''</b>"
    },
    {
        "choice1": "ผลไม้",
        "choice2": "ราชวัง",
        "choice3": "พลเมือง",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "<b>''ไม้ไผ่''</b> เป็นการสร้างคำขึ้นในภาษาไทยเหมือนคำในข้อใด"
    },
    {
        "choice1": "ไพวรินทร์ ขาวงาม",
        "choice2": "เกวรินทร์ ขาวผ่อง",
        "choice3": "เทวินทร์ ขาวเผือก",
        "choice4": "เทวี เขียวขาว",
        "correct": "1",
        "Title": "บทกลอนที่ชื่อว่า <b>''ไหมแท้ที่แม่ทอ''</b> เป็นบทกวีของกวีท่านใด"
    },
    {
        "choice1": "น้ำตาล",
        "choice2": "เขียว",
        "choice3": "ดำ",
        "choice4": "เทา",
        "correct": "3",
        "Title": "<b>''ผลมะเกลือ''</b> มียางสีอะไร"
    },
    {
        "choice1": "คำซ้ำ",
        "choice2": "คำซ้อน",
        "choice3": "คำประสม",
        "choice4": "คำพ้อง",
        "correct": "3",
        "Title": "<b>''ผ้าขาวม้า''</b> เป็นการสร้างคำขึ้นมาใช้ในภาษาไทยชนิดใด"
    },
    {
        "choice1": "ขี่",
        "choice2": "คี่",
        "choice3": "กี่",
        "choice4": "คลี่",
        "correct": "3",
        "Title": "คำตอบในข้อใดคือเครื่องมือทอผ้า"
    },
    {
        "choice1": "คลายเครียดจากการทำงาน",
        "choice2": "เพื่อความสนุก",
        "choice3": "ปลูกฝังความสมัครสมานสามัคคี",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "<b>''เพลงพวงมาลัย''</b> นิยมเล่นเพื่ออะไร"
    },
    {
        "choice1": "บันจง",
        "choice2": "บรรจง",
        "choice3": "บรรจบ",
        "choice4": "บรรจรบ",
        "correct": "2",
        "Title": "<b>''เจ้าชายก็ค่อยๆ...............กอดก้อนหินอย่างทะนุถนอม''</b> เติมคำในข้อใดจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "ไก่แจ้จะไปบ้านอา",
        "choice2": "อาหนอด",
        "choice3": "ไม่ถูก",
        "choice4": "พ่อพาไป",
        "correct": "2",
        "Title": "<b>''ไก่แจ้คงไปบ้านอาหนอดไม่ถูกแน่ๆ ถ้าพ่อไม่พาไป''</b> ข้อความที่กำหนดให้มีอักษรนำคือคำใด"
    },
    {
        "choice1": "''ห'' นำต่ำเดี่ยว",
        "choice2": "อักษรกลางนำต่ำเดี่ยว",
        "choice3": "อักษรสูงนำต่ำเดี่ยว",
        "choice4": "อักษรกลางนำอักษรสูง",
        "correct": "1",
        "Title": "<b>''ขี้เหล็ก''</b> คำว่า เหล็ก เป็นลักษณะอักษรนำในข้อใด"
    },
    {
        "choice1": "สา-หละ",
        "choice2": "สละ-ละ",
        "choice3": "สะ-หละ",
        "choice4": "สละ-หละ",
        "correct": "3",
        "Title": "<b>''สละ''</b> เป็นอักษรนำที่เกิดจากอักษรสูงนำอักษรต่ำเดี่ยวคำนี้จะออกเสียงอย่างไร"
    },
    {
        "choice1": "2 คำ",
        "choice2": "3 คำ",
        "choice3": "4 คำ",
        "choice4": "5 คำ",
        "correct": "1",
        "Title": "<b>''ย่าพูดกับไก่แจ้ว่าตกลงจะมาอยู่กับย่าที่กรุงเทพฯ ไหม''</b> ข้อความที่กำหนดให้มีอักษรนำกี่คำ"
    },
    {
        "choice1": "ผา-หนัง",
        "choice2": "ผะ-หนัง",
        "choice3": "ผา-นัง",
        "choice4": "ผะ-นัง",
        "correct": "2",
        "Title": "<b>''ผนัง''</b> อ่านว่าอย่างไร"
    },
    {
        "choice1": "อิเหนา",
        "choice2": "ขุนช้างขุนแผน",
        "choice3": "รามเกียรติ์",
        "choice4": "สามก๊ก",
        "correct": "2",
        "Title": "<b>''ปริศนาโพธิ์สามต้น''</b> เป็นส่วนหนึ่งของวรรณคดีมรดกเรื่องอะไร"
    },
    {
        "choice1": "ขุนช้างขุนแผน",
        "choice2": "อิเหนา",
        "choice3": "อุณรุท",
        "choice4": "สามก๊ก",
        "correct": "3",
        "Title": "ข้อใดไม่ใช่วรรณคดีมรดก"
    },
    {
        "choice1": "ขุนช้าง",
        "choice2": "ขุนแผน",
        "choice3": "นางวันทอง",
        "choice4": "นางศรีประจัน",
        "correct": "2",
        "Title": "<b>''พลายแก้ว''</b> ในเรื่องปริศนาโพธิ์สามต้น หมายถึงใคร"
    },
    {
        "choice1": "กลอน",
        "choice2": "โคลง",
        "choice3": "ฉันท์",
        "choice4": "กาพย์",
        "correct": "1",
        "Title": "ขุนช้างขุนแผนแต่งด้วยคำประพันธ์ชนิดใด"
    },
    {
        "choice1": "นางพิมพิลาไลย",
        "choice2": "นางวันทอง",
        "choice3": "นางทองประศรี",
        "choice4": "ถูกทั้ง ก และ ข",
        "correct": "4",
        "Title": "ขุนช้างหลงรักผู้หญิงในเรื่องปริศนาโพธิ์สามต้น คือใคร"
    },
    {
        "choice1": "พ้องรูป",
        "choice2": "พ้องเสียง",
        "choice3": "พ้องสัมผัส",
        "choice4": "พ้องสระ",
        "correct": "1",
        "Title": "<b>''โคลงเรือเรือโคลงเพราะโคลง''</b> ข้อความที่กำหนดให้เป็นคำพ้องชนิดใด"
    },
    {
        "choice1": "ภา+ระ+กิจ",
        "choice2": "ภาระ+กิจ",
        "choice3": "ภะรา+กิจ",
        "choice4": "ภัทร+กิจ",
        "correct": "2",
        "Title": "<b>''ภารกิจ''</b> เกิดจากคำศัพท์ใดสมาสกัน"
    },
    {
        "choice1": "นที",
        "choice2": "ชลธี",
        "choice3": "สายธาร",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "คำศัพท์ในข้อใด ที่มีความหมายคำไวพจน์เหมือนกับคำว่า ''ลำธาร''"
    },
    {
        "choice1": "ภาพวาด",
        "choice2": "ภาพเขียน",
        "choice3": "ภาพถ่าย",
        "choice4": "ภาพปั้น",
        "correct": "1",
        "Title": "<b>''พระสาทิสลักษณ์ของสมเด็จพระเทพรัตนราชสุดาฯ''</b> พระสาทิสลักษณ์ คือคำตอบในข้อใด"
    },
    {
        "choice1": "สม-เด็ด-พระ-เทบ-รัด-ราด-ชะ-สุ-ดา",
        "choice2": "สม-เด็ด-พระ-เทบ-พะ-รัด-ราด-สุ-ดา",
        "choice3": "สม-เด็ด-พระ-เทบ-พะ-รัด-ราด-ชะ-สุ-ดา",
        "choice4": "สม-เด็ด-พระ-เทบ-พะ-รัด-ตะ-นะ-ราด-สุ-ดา",
        "correct": "2",
        "Title": "ข้อใดเขียนคำอ่านถูกต้องที่สุด"
    },
    {
        "choice1": "สาราภาพ",
        "choice2": "สาระภาพ",
        "choice3": "สะระภาพ",
        "choice4": "สารภาพ",
        "correct": "4",
        "Title": "คำตอบใดหมายถึง <b>''ยอมรับผิด, รับโทษที่ทำ''</b>"
    },
    {
        "choice1": "ทรงเสด็จ",
        "choice2": "ทรงเสวย",
        "choice3": "ทรงชอบ",
        "choice4": "ถูกทุกข้อ",
        "correct": "4",
        "Title": "ข้อใดใช้ ทรง ผิด"
    },
    {
        "choice1": "ทรงจาบัลย์",
        "choice2": "ทรงโศก",
        "choice3": "ทรงโศกา",
        "choice4": "ทรงกันแสง",
        "correct": "4",
        "Title": "<b>''บุเรงนอง.................ถึงพระมหาอุปราชด้วยความเสียพระทัย''</b> เติมคำราชาศัพท์ใดจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "อุทร",
        "choice2": "อุระ",
        "choice3": "เพลา",
        "choice4": "มาลา",
        "correct": "4",
        "Title": "ราชาศัพท์คำใดไม่เข้าพวก"
    },
    {
        "choice1": "ทำวัตร",
        "choice2": "ทำวัด",
        "choice3": "จำวัตร",
        "choice4": "จำวัด",
        "correct": "1",
        "Title": "<b>''พระสงฆ์ต้อง..............เช้าเย็นเพราะเป็นกิจของสงฆ์''</b> เติมคำศัพท์ใดจึงจะถูกต้องที่สุด"
    },
    {
        "choice1": "สรงน้ำ",
        "choice2": "เสวยน้ำ",
        "choice3": "ทรงสรง",
        "choice4": "ลงสรง",
        "correct": "1",
        "Title": "<b>''พระสงฆ์อาบน้ำ''</b> ตรงกับคำศัพท์ในข้อใด"
    },
    {
        "choice1": "ฉัน",
        "choice2": "กระผม",
        "choice3": "อาตมา",
        "choice4": "โยม",
        "correct": "3",
        "Title": "พระสงฆ์เมื่อพูดคุยกับฆราวาสจะใช้สรรพนามแทนตนเองว่าอย่างไร"
    },
    {
        "choice1": "มณฑิก",
        "choice2": "มณโฑ",
        "choice3": "มณฑก",
        "choice4": "ถูกทั้ง ข และ ค",
        "correct": "4",
        "Title": "<b>''คางคก''</b> มีคำไวพจน์ตรงกับคำตอบในข้อใด"
    },
    {
        "choice1": "วันที่ผ่านวันนี้มาหนึ่งวัน",
        "choice2": "วันที่ผ่านวันนี้มาสองวัน",
        "choice3": "วันที่ผ่านวันนี้มาแล้วหลายวัน",
        "choice4": "วันที่ต่อจากวันนี้หนึ่งวัน",
        "correct": "1",
        "Title": "<b>''เมื่อวาน''</b> หมายถึงคำตอบในข้อใด"
    },
    {
        "choice1": "หน้า",
        "choice2": "หน้าผาก",
        "choice3": "คิ้ว",
        "choice4": "ไหล่",
        "correct": "1",
        "Title": "''ทันใดนั้น นกบินมาเกาะกิ่งไม้ตรงหน้า<u>พระพักตร์</u>'' คำที่ขีดเส้นใต้หมายถึงข้อใด"
    },
    {
        "choice1": "คิด",
        "choice2": "พูด",
        "choice3": "ถาม",
        "choice4": "สั่ง",
        "correct": "2",
        "Title": "''เจ้าชาย<u>ตรัส</u>ถามพ่อครัวว่าทำไมวันนี้แตงโมมี 2 ลูก'' คำที่ขีดเส้นใต้หมายถึงข้อใด"
    },
    {
        "choice1": "ๆ",
        "choice2": "ฯลฯ",
        "choice3": "ฯ",
        "choice4": "ฯฯ",
        "correct": "3",
        "Title": "กรุงเทพ เป็นเมืองหลวงของไทย ควรเติมเครื่องหมายวรรคตอนข้อใด"
    },
    {
        "choice1": "บิณฑบาตร",
        "choice2": "บิณทบาต",
        "choice3": "บินฑบาต",
        "choice4": "บิณฑบาต",
        "correct": "4",
        "Title": "<b>''อาตมาขอ....................เถอะโยม''</b> เติมคำลงในช่องว่างให้ถูกต้อง"
    },
    {
        "choice1": "ประโยคความเดียว",
        "choice2": "ประโยคความรวม",
        "choice3": "ประโยคความซ้อน",
        "choice4": "ประโยคการัต",
        "correct": "3",
        "Title": "<b>''ฝูงแห่งผึ้งบินตอมน้ำหวาน''</b> ประโยคที่กำหนดให้เป็นประโยคชนิดใด"
    },
    {
        "choice1": "คำคม",
        "choice2": "คำขวัญ",
        "choice3": "สำนวน",
        "choice4": "สุภาษิต",
        "correct": "4",
        "Title": "<b>''คบคนพาล พาลพาไปหาผิด''</b> มีลักษณะเป็นการเขียนชนิดใด"
    },
    {
        "choice1": "อยุธยา",
        "choice2": "อยุธยาตอนต้น",
        "choice3": "อยุธยาตอนกลาง",
        "choice4": "อยุธยาตอนปลาย",
        "correct": "1",
        "Title": "โคลงโลกนิติเป็นหนังสือที่มีมาแต่สมัยใด"
    },
    {
        "choice1": "โคลงสี่สุภาพ",
        "choice2": "ฉันท์",
        "choice3": "กาพย์",
        "choice4": "กลอน",
        "correct": "1",
        "Title": "โคลงโลกนิติใช้คำประพันธ์ประเภทใดแต่ง"
    },
];